Change architecture README diagram to Mermaid
